In [1]:
import pandas as pd

In [2]:
df_1 = pd.read_csv("Resonses1.csv")
df_2 = pd.read_csv("Responses2.csv")

In [3]:
df = df_1.append(df_2)

In [4]:
dataset =  df[["IA","Score","Full Name: ","Class Roll Number"]]
print(dataset.head())
dataset = dataset.sort_values(by='Class Roll Number')
dataset = dataset.set_index(['Full Name: '])

   IA    Score     Full Name:   Class Roll Number
0 NaN  23 / 25         Stuti                  601
1 NaN  21 / 25    Sonali Dabas                234
2 NaN  21 / 25        UJJWAL R                964
3 NaN  25 / 25  Pooja santhosh                235
4 NaN  17 / 25          Himani                440

In [5]:
dataset.head()
dataset = dataset.reset_index()
dataset.head()
# dataset = dataset.drop(columns=['index','level_0'])

      Full Name:   IA    Score  Class Roll Number
0      Shreya Das NaN  25 / 25                 40
1  Lakita khidtta NaN  23 / 25                 51
2   Pooja jayaraj NaN  23 / 25                108
3     Pema Tanwar NaN  23 / 25                129
4    Ananya singh NaN  23 / 25                137

In [6]:
list_column = dataset.columns.values
df = pd.DataFrame(columns = list_column)
df['Full Name: ']=['Raghav']
df.head()

df.loc[0] = dataset.loc[dataset['Class Roll Number'].idxmax()]
df.loc[1]= dataset.loc[dataset['Class Roll Number'].idxmin()]

In [7]:
df.head()

       Full Name:    IA    Score Class Roll Number
0  HIMANSHU SHARMA  NaN  13 / 25              1628
1       Shreya Das  NaN  25 / 25                40

In [8]:
value = (dataset["Class Roll Number"]==40)
# this returns a series where this statement is true or false 
we are printing the value 
dataset[value].head()

  Full Name:   IA    Score  Class Roll Number
0  Shreya Das NaN  25 / 25                 40

In [9]:
dataset.head()

      Full Name:   IA    Score  Class Roll Number
0      Shreya Das NaN  25 / 25                 40
1  Lakita khidtta NaN  23 / 25                 51
2   Pooja jayaraj NaN  23 / 25                108
3     Pema Tanwar NaN  23 / 25                129
4    Ananya singh NaN  23 / 25                137

In [10]:
df.where(df['Class Roll Number']==1628)

       Full Name:    IA    Score Class Roll Number
0  HIMANSHU SHARMA  NaN  13 / 25              1628
1              NaN  NaN      NaN               NaN